{
  "title": "Welcome to react using react-i18next",
  "meta": {
    "title":"Andriamahay IRIMANANA | Portfolio | Developer Frontend",
    "description":"Experienced front-end developer specializing in responsive, user-friendly web apps. Skilled in HTML, CSS, JavaScript, and React.js. Expert in transforming designs into clean, maintainable code. Collaborative team player focused on high-quality digital experiences. Explore my portfolio to see my work.",
    "keywords":"Andriamahay, Andriamahay IRIMANANA, Andriamahay IRIMANANA Portfolio, Andriamahay IRIMANANA Developer Frontend"
  },
  "description": {
    "part1": "To get started, edit <1>src/App.js</1> and save to reload.",
    "part2": "Switch language between english and german using buttons above."
  },
  "menu":{
    "home": "Home",
    "about": "About",
    "contact": "Contact",
    "projects": "Projects"
  },
  "banner" : {
    "title": "Greetings, my name is Mahay.",
    "description": "A Frontend Developer specialized in web development, committed to crafting compelling user interfaces and experiences for websites and web applications, thereby contributing to the overall success of the products.",
    "textButton": "See my projects",
    "altImage": "Banner front"
  },
  "aboutTitle": {
    "title": "About me",
    "desc": "In this section, you'll find a detailed overview of my passion for front-end development and the skills I bring to the table. I'm dedicated to creating visually appealing and functional interfaces, with expertise in various tools and technologies. Explore to discover more about my commitment to delivering high-quality front-end solutions."
  },
  "blockInfo":{
    "title": "Front-End Developer",
    "desc":"👋 Hello World! I'm Mahay, a passionate front-end developer with a knack for transforming ideas into captivating digital experiences. 💻✨ <br/><br/>🚀 Armed with a creative mindset and a love for clean, efficient code, I thrive on the challenges of bringing user interfaces to life. From crafting seamless user journeys to ensuring pixel-perfect design implementation, I am dedicated to delivering web solutions that not only meet but exceed expectations. <br/><br/>🎨 My toolkit includes the latest front-end technologies such as HTML5, CSS3, and JavaScript, and I'm always eager to stay ahead of the curve with emerging trends like React.js and Vue.js. I believe in the power of responsive design, ensuring that the user experience remains flawless across devices. <br/><br/>🛠️ Whether it's optimizing website performance, enhancing interactivity, or collaborating with cross-functional teams, I'm committed to creating web applications that resonate with users and leave a lasting impression.  <br/><br/> 💡 Let's build something extraordinary together – where design meets functionality, and user satisfaction takes center stage. Feel free to reach out for collaborations, ideas, or just a good coding chat! 🚀🌐",
    "valBtn": "See my projects"
  },
  "skillsTitle":"My skills",
  "aboutProjects": {
    "title": "Projects",
    "desc": "In this section, explore my personal achievements for a tangible glimpse into my expertise."
  },
  "projet":{
    "1":{
      "title": "First IMMO",
      "desc": "The website of First IMMO, available at www.firstimmo.mg, is a platform specialized in real estate in Madagascar. With a user-friendly interface, the site provides a comprehensive range of services for individuals seeking real estate properties, whether for rent or purchase.",
      "valBtn": "See project",
      "altImage": "Project image 1"
    },
    "2":{
      "title": "SANKO",
      "desc": "I created the landing page for the company SANKO. SANKO is an insurance brokerage and organizational consulting firm based in Madagascar and operating across the African continent.",
      "valBtn": "See project",
      "altImage": "Project image 2"
    },
    "3":{
      "title": "TOA",
      "desc": "TOA is a market leader in the telecommunications tower infrastructure. I developed the front end of the showcase website with the Elementor team.",
      "valBtn": "See project",
      "altImage": "Project image 3"
    },
    "4":{
      "title": "Mind money",
      "desc": "Mind Money is a web application for tracking expenses. I developed it with Next JS, HTML5, CSS3 and PostgreSQL.",
      "valBtn": "See project",
      "altImage": "Project image 4"
    },
    "5":{
      "title": "Taskmanager",
      "desc": "Taskmanager is a web-based application, accessible via a web browser. This means that users can access it from any Internet-connected device, whether it's a desktop computer, laptop, tablet, or even a smartphone. Developed with React JS, HTML5, CSS3, and Firebase.",
      "valBtn": "See project",
      "altImage": "Project image 5"
    },
    "6":{
      "title": "Greengascar",
      "desc": "GreenGascar is Madagascar's first carbon footprint calculator. It helps users measure and reduce their environmental impact by analyzing energy consumption, transportation, and waste. The site was developed with React JS, HTML5, CSS3, and Wordpress.",
      "valBtn": "See project",
      "altImage": "Project image 6"
    },
    "7":{
      "title": "Travelian",
      "desc": "Travelian is a travel-dedicated website providing information on popular destinations like Norway and Switzerland. It offers travel guides, itineraries, special offers, and a blog on travel experiences. The site also features a photo gallery of destinations and traveler testimonials. The one-page site is built using Next.js, HTML5, and CSS3.",
      "valBtn": "See project",
      "altImage": "Project image 7"
    }
  },
  "contact":{
    "title": "Contact",
    "desc": "Feel free to get in touch by completing the form below, and I'll promptly respond at your earliest convenience."
  },
  "form":{
    "name": "name",
    "email": "email",
    "message": "message",
    "valBtn": "submit",
    "popupVal": "Your message has been sent!",
    "valTxtBtn": "Validate",
    "placeholderName": "Enter your name",
    "placeholderEmail": "Enter your email",
    "placeholderMessage": "Enter your message"
  },
  "footer":{
    "title": "Follow me",
    "desc": "A Web Developer specializing in Frontend development, dedicated to constructing the user interface and experience for websites and web applications, contributing to the overall success of the product.",
    "copyright": "made by"
  }
}